In [1]:
import pandas as pd

In [10]:
pd.read_csv(r'C:\Users\Lenovo\Desktop\mydata3.csv')

   Rollno     name  batch
0    1001  shourab   1232
1    1021     anuj   1122
2    9871   harish   2244

In [8]:
pd.read_csv(r'C:\Users\Lenovo\Desktop\mydata3.tsv', sep='\t')

   Rollno     name  batch
0    1001  shourab   1232
1    1021     anuj   1122
2    9871   harish   2244

In [6]:
pd.read_csv(r'C:\Users\Lenovo\Desktop\test.csv')

    name  class    city
0  rohit     10   delhi
1    raj     10  mumbai
2   aman     12     goa

In [10]:
pd.read_csv(r'C:\Users\Lenovo\Desktop\Mydata3.tsv',sep='\t')

   Rollno     name  batch
0    1001  shourab   1232
1    1021     anuj   1122
2    9871   harish   2244

In [11]:
pd.read_excel(r'C:\Users\Lenovo\Desktop\Mydata1.xlsx')

               name  age  salary
0  Shourabh bewkoof   28   35000
1    Shourabh pagal   27   42000
2    Shourabh gadha   26   25000
3    Shourabh pajji   22   45000

In [12]:
pd.read_csv(r'C:\Users\Lenovo\Desktop\mydata3.csv')

   Rollno     name  batch
0    1001  shourab   1232
1    1021     anuj   1122
2    9871   harish   2244

In [28]:
df=pd.read_csv(r'C:\Users\Lenovo\Desktop\dataset\account.csv')
print(df)
print(df.loc[:, 'account number':'balance'])

   account number  name  balance     type
0            1001  amit    12000   saving
1            1002  raju    15000  current
2            1003  kaju    25000   saving
3            1004  sonu    21000  current
4            1005  monu    28000   saving
   account number  name  balance
0            1001  amit    12000
1            1002  raju    15000
2            1003  kaju    25000
3            1004  sonu    21000
4            1005  monu    28000

In [29]:
df=pd.read_excel(r'C:\Users\Lenovo\Desktop\Mydata1.xlsx')

In [31]:
print(df)
print(df.loc[:,'name':'age'])

               name  age  salary
0  Shourabh bewkoof   28   35000
1    Shourabh pagal   27   42000
2    Shourabh gadha   26   25000
3    Shourabh pajji   22   45000
               name  age
0  Shourabh bewkoof   28
1    Shourabh pagal   27
2    Shourabh gadha   26
3    Shourabh pajji   22

In [ ]:
df=pd.read_csv